# DuplicateEntry Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..KeyBasedTreeEntryFailures..::..DuplicateEntry Property
BuiltInFailures..::..KeyBasedTreeEntryFailures Class See Also
---
Duplicate code '[Code]', description: '[Description]'
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DuplicateEntry { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DuplicateEntry As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DuplicateEntry {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..KeyBasedTreeEntryFailures Class
Autodesk.Revit.DB Namespace